FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_adc.h
/**
 * \file
 *
 * \brief Component description for ADC
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20_ADC_COMPONENT_
#define _SAMD20_ADC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ADC */
/* ========================================================================== */
/** \addtogroup SAMD20_ADC Analog Digital Converter */
/*@{*/

#define REV_ADC    0x110

/* -------- ADC_CTRLA : (ADC Offset: 0x00) (R/W  8) Control Register A -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t SWRST : 1;    /*!< bit:      0  Software Reset                     */
            uint8_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint8_t RUNSTDBY : 1; /*!< bit:      2  Run during Standby                 */
            uint8_t  : 5;         /*!< bit:  3.. 7  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint8_t reg;              /*!< Type      used for register access              */
    } ADC_CTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_CTRLA_OFFSET          0x00           /**< \brief (ADC_CTRLA offset) Control Register A */
#define ADC_CTRLA_RESETVALUE      0x00           /**< \brief (ADC_CTRLA reset_value) Control Register A */

#define ADC_CTRLA_SWRST_Pos       0              /**< \brief (ADC_CTRLA) Software Reset */
#define ADC_CTRLA_SWRST           ( 0x1u << ADC_CTRLA_SWRST_Pos )
#define ADC_CTRLA_ENABLE_Pos      1              /**< \brief (ADC_CTRLA) Enable */
#define ADC_CTRLA_ENABLE          ( 0x1u << ADC_CTRLA_ENABLE_Pos )
#define ADC_CTRLA_RUNSTDBY_Pos    2              /**< \brief (ADC_CTRLA) Run during Standby */
#define ADC_CTRLA_RUNSTDBY        ( 0x1u << ADC_CTRLA_RUNSTDBY_Pos )
#define ADC_CTRLA_MASK            0x07u          /**< \brief (ADC_CTRLA) MASK Register */

/* -------- ADC_REFCTRL : (ADC Offset: 0x01) (R/W  8) Reference Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t REFSEL : 4;  /*!< bit:  0.. 3  Reference Selection                */
            uint8_t  : 3;        /*!< bit:  4.. 6  Reserved                           */
            uint8_t REFCOMP : 1; /*!< bit:      7  Reference Buffer Offset Compensation Enable */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } ADC_REFCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_REFCTRL_OFFSET              0x01     /**< \brief (ADC_REFCTRL offset) Reference Control Register */
#define ADC_REFCTRL_RESETVALUE          0x00     /**< \brief (ADC_REFCTRL reset_value) Reference Control Register */

#define ADC_REFCTRL_REFSEL_Pos          0        /**< \brief (ADC_REFCTRL) Reference Selection */
#define ADC_REFCTRL_REFSEL_Msk          ( 0xFu << ADC_REFCTRL_REFSEL_Pos )
#define ADC_REFCTRL_REFSEL( value )    ( ( ADC_REFCTRL_REFSEL_Msk & ( ( value ) << ADC_REFCTRL_REFSEL_Pos ) ) )
#define   ADC_REFCTRL_REFSEL_INT1V      ( 0x0u << 0 ) /**< \brief (ADC_REFCTRL)  */
#define   ADC_REFCTRL_REFSEL_INTVCC0    ( 0x1u << 0 ) /**< \brief (ADC_REFCTRL)  */
#define   ADC_REFCTRL_REFSEL_INTVCC1    ( 0x2u << 0 ) /**< \brief (ADC_REFCTRL)  */
#define   ADC_REFCTRL_REFSEL_AREFA      ( 0x3u << 0 ) /**< \brief (ADC_REFCTRL)  */
#define   ADC_REFCTRL_REFSEL_AREFB      ( 0x4u << 0 ) /**< \brief (ADC_REFCTRL)  */
#define ADC_REFCTRL_REFCOMP_Pos         7             /**< \brief (ADC_REFCTRL) Reference Buffer Offset Compensation Enable */
#define ADC_REFCTRL_REFCOMP             ( 0x1u << ADC_REFCTRL_REFCOMP_Pos )
#define ADC_REFCTRL_MASK                0x8Fu         /**< \brief (ADC_REFCTRL) MASK Register */

/* -------- ADC_AVGCTRL : (ADC Offset: 0x02) (R/W  8) Average Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t SAMPLENUM : 4; /*!< bit:  0.. 3  Number of Samples to be Collected  */
            uint8_t ADJRES : 3;    /*!< bit:  4.. 6  Adjusting Result / Division Coefficient */
            uint8_t  : 1;          /*!< bit:      7  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint8_t reg;               /*!< Type      used for register access              */
    } ADC_AVGCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_AVGCTRL_OFFSET              0x02     /**< \brief (ADC_AVGCTRL offset) Average Control Register */
#define ADC_AVGCTRL_RESETVALUE          0x00     /**< \brief (ADC_AVGCTRL reset_value) Average Control Register */

#define ADC_AVGCTRL_SAMPLENUM_Pos       0        /**< \brief (ADC_AVGCTRL) Number of Samples to be Collected */
#define ADC_AVGCTRL_SAMPLENUM_Msk       ( 0xFu << ADC_AVGCTRL_SAMPLENUM_Pos )
#define ADC_AVGCTRL_SAMPLENUM( value )    ( ( ADC_AVGCTRL_SAMPLENUM_Msk & ( ( value ) << ADC_AVGCTRL_SAMPLENUM_Pos ) ) )
#define   ADC_AVGCTRL_SAMPLENUM_1       ( 0x0u << 0 ) /**< \brief (ADC_AVGCTRL)  */
#define   ADC_AVGCTRL_SAMPLENUM_2       ( 0x1u << 0 ) /**< \brief (ADC_AVGCTRL)  */
#define   ADC_AVGCTRL_SAMPLENUM_4       ( 0x2u << 0 ) /**< \brief (ADC_AVGCTRL)  */
#define   ADC_AVGCTRL_SAMPLENUM_8       ( 0x3u << 0 ) /**< \brief (ADC_AVGCTRL)  */
#define   ADC_AVGCTRL_SAMPLENUM_16      ( 0x4u << 0 ) /**< \brief (ADC_AVGCTRL)  */
#define   ADC_AVGCTRL_SAMPLENUM_32      ( 0x5u << 0 ) /**< \brief (ADC_AVGCTRL)  */
#define   ADC_AVGCTRL_SAMPLENUM_64      ( 0x6u << 0 ) /**< \brief (ADC_AVGCTRL)  */
#define   ADC_AVGCTRL_SAMPLENUM_128     ( 0x7u << 0 ) /**< \brief (ADC_AVGCTRL)  */
#define   ADC_AVGCTRL_SAMPLENUM_256     ( 0x8u << 0 ) /**< \brief (ADC_AVGCTRL)  */
#define   ADC_AVGCTRL_SAMPLENUM_512     ( 0x9u << 0 ) /**< \brief (ADC_AVGCTRL)  */
#define   ADC_AVGCTRL_SAMPLENUM_1024    ( 0xAu << 0 ) /**< \brief (ADC_AVGCTRL)  */
#define ADC_AVGCTRL_ADJRES_Pos          4             /**< \brief (ADC_AVGCTRL) Adjusting Result / Division Coefficient */
#define ADC_AVGCTRL_ADJRES_Msk          ( 0x7u << ADC_AVGCTRL_ADJRES_Pos )
#define ADC_AVGCTRL_ADJRES( value )    ( ( ADC_AVGCTRL_ADJRES_Msk & ( ( value ) << ADC_AVGCTRL_ADJRES_Pos ) ) )
#define ADC_AVGCTRL_MASK                0x7Fu    /**< \brief (ADC_AVGCTRL) MASK Register */

