FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_adc.h
/* -------- ADC_SAMPCTRL : (ADC Offset: 0x03) (R/W  8) Sample Time Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t SAMPLEN : 6; /*!< bit:  0.. 5  Sampling Time Length               */
            uint8_t  : 2;        /*!< bit:  6.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } ADC_SAMPCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_SAMPCTRL_OFFSET         0x03         /**< \brief (ADC_SAMPCTRL offset) Sample Time Control Register */
#define ADC_SAMPCTRL_RESETVALUE     0x00         /**< \brief (ADC_SAMPCTRL reset_value) Sample Time Control Register */

#define ADC_SAMPCTRL_SAMPLEN_Pos    0            /**< \brief (ADC_SAMPCTRL) Sampling Time Length */
#define ADC_SAMPCTRL_SAMPLEN_Msk    ( 0x3Fu << ADC_SAMPCTRL_SAMPLEN_Pos )
#define ADC_SAMPCTRL_SAMPLEN( value )    ( ( ADC_SAMPCTRL_SAMPLEN_Msk & ( ( value ) << ADC_SAMPCTRL_SAMPLEN_Pos ) ) )
#define ADC_SAMPCTRL_MASK           0x3Fu        /**< \brief (ADC_SAMPCTRL) MASK Register */

/* -------- ADC_CTRLB : (ADC Offset: 0x04) (R/W 16) Control Register B -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t DIFFMODE : 1;  /*!< bit:      0  Differential Mode                  */
            uint16_t LEFTADJ : 1;   /*!< bit:      1  Left-Adjusted Result               */
            uint16_t FREERUN : 1;   /*!< bit:      2  Free Running Mode                  */
            uint16_t CORREN : 1;    /*!< bit:      3  Digital Correction Logic Enable    */
            uint16_t RESSEL : 2;    /*!< bit:  4.. 5  Conversion Result Resolution       */
            uint16_t : 2;           /*!< bit:  6.. 7  Reserved                           */
            uint16_t PRESCALER : 3; /*!< bit:  8..10  Prescaler Configuration            */
            uint16_t : 5;           /*!< bit: 11..15  Reserved                           */
        } bit;                      /*!< Structure used for bit  access                  */
        uint16_t reg;               /*!< Type      used for register access              */
    } ADC_CTRLB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_CTRLB_OFFSET                0x04     /**< \brief (ADC_CTRLB offset) Control Register B */
#define ADC_CTRLB_RESETVALUE            0x0000   /**< \brief (ADC_CTRLB reset_value) Control Register B */

#define ADC_CTRLB_DIFFMODE_Pos          0        /**< \brief (ADC_CTRLB) Differential Mode */
#define ADC_CTRLB_DIFFMODE              ( 0x1u << ADC_CTRLB_DIFFMODE_Pos )
#define ADC_CTRLB_LEFTADJ_Pos           1        /**< \brief (ADC_CTRLB) Left-Adjusted Result */
#define ADC_CTRLB_LEFTADJ               ( 0x1u << ADC_CTRLB_LEFTADJ_Pos )
#define ADC_CTRLB_FREERUN_Pos           2        /**< \brief (ADC_CTRLB) Free Running Mode */
#define ADC_CTRLB_FREERUN               ( 0x1u << ADC_CTRLB_FREERUN_Pos )
#define ADC_CTRLB_CORREN_Pos            3        /**< \brief (ADC_CTRLB) Digital Correction Logic Enable */
#define ADC_CTRLB_CORREN                ( 0x1u << ADC_CTRLB_CORREN_Pos )
#define ADC_CTRLB_RESSEL_Pos            4        /**< \brief (ADC_CTRLB) Conversion Result Resolution */
#define ADC_CTRLB_RESSEL_Msk            ( 0x3u << ADC_CTRLB_RESSEL_Pos )
#define ADC_CTRLB_RESSEL( value )    ( ( ADC_CTRLB_RESSEL_Msk & ( ( value ) << ADC_CTRLB_RESSEL_Pos ) ) )
#define   ADC_CTRLB_RESSEL_12BIT        ( 0x0u << 4 ) /**< \brief (ADC_CTRLB)  */
#define   ADC_CTRLB_RESSEL_16BIT        ( 0x1u << 4 ) /**< \brief (ADC_CTRLB)  */
#define   ADC_CTRLB_RESSEL_10BIT        ( 0x2u << 4 ) /**< \brief (ADC_CTRLB)  */
#define   ADC_CTRLB_RESSEL_8BIT         ( 0x3u << 4 ) /**< \brief (ADC_CTRLB)  */
#define ADC_CTRLB_PRESCALER_Pos         8             /**< \brief (ADC_CTRLB) Prescaler Configuration */
#define ADC_CTRLB_PRESCALER_Msk         ( 0x7u << ADC_CTRLB_PRESCALER_Pos )
#define ADC_CTRLB_PRESCALER( value )    ( ( ADC_CTRLB_PRESCALER_Msk & ( ( value ) << ADC_CTRLB_PRESCALER_Pos ) ) )
#define   ADC_CTRLB_PRESCALER_DIV4      ( 0x0u << 8 ) /**< \brief (ADC_CTRLB)  */
#define   ADC_CTRLB_PRESCALER_DIV8      ( 0x1u << 8 ) /**< \brief (ADC_CTRLB)  */
#define   ADC_CTRLB_PRESCALER_DIV16     ( 0x2u << 8 ) /**< \brief (ADC_CTRLB)  */
#define   ADC_CTRLB_PRESCALER_DIV32     ( 0x3u << 8 ) /**< \brief (ADC_CTRLB)  */
#define   ADC_CTRLB_PRESCALER_DIV64     ( 0x4u << 8 ) /**< \brief (ADC_CTRLB)  */
#define   ADC_CTRLB_PRESCALER_DIV128    ( 0x5u << 8 ) /**< \brief (ADC_CTRLB)  */
#define   ADC_CTRLB_PRESCALER_DIV256    ( 0x6u << 8 ) /**< \brief (ADC_CTRLB)  */
#define   ADC_CTRLB_PRESCALER_DIV512    ( 0x7u << 8 ) /**< \brief (ADC_CTRLB)  */
#define ADC_CTRLB_MASK                  0x073Fu       /**< \brief (ADC_CTRLB) MASK Register */

/* -------- ADC_WINCTRL : (ADC Offset: 0x08) (R/W  8) Window Monitor Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t WINMODE : 3; /*!< bit:  0.. 2  Window Monitor Mode                */
            uint8_t  : 5;        /*!< bit:  3.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } ADC_WINCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_WINCTRL_OFFSET               0x08    /**< \brief (ADC_WINCTRL offset) Window Monitor Control Register */
#define ADC_WINCTRL_RESETVALUE           0x00    /**< \brief (ADC_WINCTRL reset_value) Window Monitor Control Register */

#define ADC_WINCTRL_WINMODE_Pos          0       /**< \brief (ADC_WINCTRL) Window Monitor Mode */
#define ADC_WINCTRL_WINMODE_Msk          ( 0x7u << ADC_WINCTRL_WINMODE_Pos )
#define ADC_WINCTRL_WINMODE( value )    ( ( ADC_WINCTRL_WINMODE_Msk & ( ( value ) << ADC_WINCTRL_WINMODE_Pos ) ) )
#define   ADC_WINCTRL_WINMODE_DISABLE    ( 0x0u << 0 ) /**< \brief (ADC_WINCTRL)  */
#define   ADC_WINCTRL_WINMODE_MODE1      ( 0x1u << 0 ) /**< \brief (ADC_WINCTRL)  */
#define   ADC_WINCTRL_WINMODE_MODE2      ( 0x2u << 0 ) /**< \brief (ADC_WINCTRL)  */
#define   ADC_WINCTRL_WINMODE_MODE3      ( 0x3u << 0 ) /**< \brief (ADC_WINCTRL)  */
#define   ADC_WINCTRL_WINMODE_MODE4      ( 0x4u << 0 ) /**< \brief (ADC_WINCTRL)  */
#define ADC_WINCTRL_MASK                 0x07u         /**< \brief (ADC_WINCTRL) MASK Register */

/* -------- ADC_SWTRIG : (ADC Offset: 0x0C) (R/W  8) Control Register B -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t FLUSH : 1; /*!< bit:      0  ADC Flush                          */
            uint8_t START : 1; /*!< bit:      1  Start ADC Conversion               */
            uint8_t  : 6;      /*!< bit:  2.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } ADC_SWTRIG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

