FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_adc.h
#define ADC_SWTRIG_OFFSET        0x0C            /**< \brief (ADC_SWTRIG offset) Control Register B */
#define ADC_SWTRIG_RESETVALUE    0x00            /**< \brief (ADC_SWTRIG reset_value) Control Register B */

#define ADC_SWTRIG_FLUSH_Pos     0               /**< \brief (ADC_SWTRIG) ADC Flush */
#define ADC_SWTRIG_FLUSH         ( 0x1u << ADC_SWTRIG_FLUSH_Pos )
#define ADC_SWTRIG_START_Pos     1               /**< \brief (ADC_SWTRIG) Start ADC Conversion */
#define ADC_SWTRIG_START         ( 0x1u << ADC_SWTRIG_START_Pos )
#define ADC_SWTRIG_MASK          0x03u           /**< \brief (ADC_SWTRIG) MASK Register */

/* -------- ADC_INPUTCTRL : (ADC Offset: 0x10) (R/W 32) Input Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t MUXPOS : 5;      /*!< bit:  0.. 4  Positive Mux Input Selection       */
            uint32_t : 3;             /*!< bit:  5.. 7  Reserved                           */
            uint32_t MUXNEG : 5;      /*!< bit:  8..12  Negative Mux Input Selection       */
            uint32_t : 3;             /*!< bit: 13..15  Reserved                           */
            uint32_t INPUTSCAN : 4;   /*!< bit: 16..19  Number of Input Channels Included in Scan */
            uint32_t INPUTOFFSET : 4; /*!< bit: 20..23  Positive Mux Setting Offset        */
            uint32_t GAIN : 4;        /*!< bit: 24..27  Gain Value                         */
            uint32_t : 4;             /*!< bit: 28..31  Reserved                           */
        } bit;                        /*!< Structure used for bit  access                  */
        uint32_t reg;                 /*!< Type      used for register access              */
    } ADC_INPUTCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_INPUTCTRL_OFFSET                    0x10       /**< \brief (ADC_INPUTCTRL offset) Input Control Register */
#define ADC_INPUTCTRL_RESETVALUE                0x00000000 /**< \brief (ADC_INPUTCTRL reset_value) Input Control Register */

#define ADC_INPUTCTRL_MUXPOS_Pos                0          /**< \brief (ADC_INPUTCTRL) Positive Mux Input Selection */
#define ADC_INPUTCTRL_MUXPOS_Msk                ( 0x1Fu << ADC_INPUTCTRL_MUXPOS_Pos )
#define ADC_INPUTCTRL_MUXPOS( value )    ( ( ADC_INPUTCTRL_MUXPOS_Msk & ( ( value ) << ADC_INPUTCTRL_MUXPOS_Pos ) ) )
#define   ADC_INPUTCTRL_MUXPOS_PIN0             ( 0x0u << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN1             ( 0x1u << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN2             ( 0x2u << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN3             ( 0x3u << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN4             ( 0x4u << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN5             ( 0x5u << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN6             ( 0x6u << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN7             ( 0x7u << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN8             ( 0x8u << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN9             ( 0x9u << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN10            ( 0xAu << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN11            ( 0xBu << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN12            ( 0xCu << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN13            ( 0xDu << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN14            ( 0xEu << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN15            ( 0xFu << 0 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN16            ( 0x10u << 0 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN17            ( 0x11u << 0 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN18            ( 0x12u << 0 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN19            ( 0x13u << 0 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN20            ( 0x14u << 0 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN21            ( 0x15u << 0 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN22            ( 0x16u << 0 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_PIN23            ( 0x17u << 0 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_TEMP             ( 0x18u << 0 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_BANDGAP          ( 0x19u << 0 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_SCALEDCOREVCC    ( 0x1Au << 0 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_SCALEDIOVCC      ( 0x1Bu << 0 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXPOS_DAC              ( 0x1Cu << 0 ) /**< \brief (ADC_INPUTCTRL)  */
#define ADC_INPUTCTRL_MUXNEG_Pos                8              /**< \brief (ADC_INPUTCTRL) Negative Mux Input Selection */
#define ADC_INPUTCTRL_MUXNEG_Msk                ( 0x1Fu << ADC_INPUTCTRL_MUXNEG_Pos )
#define ADC_INPUTCTRL_MUXNEG( value )    ( ( ADC_INPUTCTRL_MUXNEG_Msk & ( ( value ) << ADC_INPUTCTRL_MUXNEG_Pos ) ) )
#define   ADC_INPUTCTRL_MUXNEG_PIN0             ( 0x0u << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN1             ( 0x1u << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN2             ( 0x2u << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN3             ( 0x3u << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN4             ( 0x4u << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN5             ( 0x5u << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN6             ( 0x6u << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN7             ( 0x7u << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN8             ( 0x8u << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN9             ( 0x9u << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN10            ( 0xAu << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN11            ( 0xBu << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN12            ( 0xCu << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN13            ( 0xDu << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN14            ( 0xEu << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN15            ( 0xFu << 8 )  /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN16            ( 0x10u << 8 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN17            ( 0x11u << 8 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN18            ( 0x12u << 8 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN19            ( 0x13u << 8 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN20            ( 0x14u << 8 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN21            ( 0x15u << 8 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN22            ( 0x16u << 8 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_PIN23            ( 0x17u << 8 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_GND              ( 0x18u << 8 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_MUXNEG_IOGND            ( 0x19u << 8 ) /**< \brief (ADC_INPUTCTRL)  */
#define ADC_INPUTCTRL_INPUTSCAN_Pos             16             /**< \brief (ADC_INPUTCTRL) Number of Input Channels Included in Scan */
#define ADC_INPUTCTRL_INPUTSCAN_Msk             ( 0xFu << ADC_INPUTCTRL_INPUTSCAN_Pos )
#define ADC_INPUTCTRL_INPUTSCAN( value )      ( ( ADC_INPUTCTRL_INPUTSCAN_Msk & ( ( value ) << ADC_INPUTCTRL_INPUTSCAN_Pos ) ) )
#define ADC_INPUTCTRL_INPUTOFFSET_Pos           20 /**< \brief (ADC_INPUTCTRL) Positive Mux Setting Offset */
#define ADC_INPUTCTRL_INPUTOFFSET_Msk           ( 0xFu << ADC_INPUTCTRL_INPUTOFFSET_Pos )
#define ADC_INPUTCTRL_INPUTOFFSET( value )    ( ( ADC_INPUTCTRL_INPUTOFFSET_Msk & ( ( value ) << ADC_INPUTCTRL_INPUTOFFSET_Pos ) ) )
#define ADC_INPUTCTRL_GAIN_Pos                  24 /**< \brief (ADC_INPUTCTRL) Gain Value */
#define ADC_INPUTCTRL_GAIN_Msk                  ( 0xFu << ADC_INPUTCTRL_GAIN_Pos )
#define ADC_INPUTCTRL_GAIN( value )           ( ( ADC_INPUTCTRL_GAIN_Msk & ( ( value ) << ADC_INPUTCTRL_GAIN_Pos ) ) )
#define   ADC_INPUTCTRL_GAIN_1X                 ( 0x0u << 24 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_GAIN_2X                 ( 0x1u << 24 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_GAIN_4X                 ( 0x2u << 24 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_GAIN_8X                 ( 0x3u << 24 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_GAIN_16X                ( 0x4u << 24 ) /**< \brief (ADC_INPUTCTRL)  */
#define   ADC_INPUTCTRL_GAIN_DIV2               ( 0xFu << 24 ) /**< \brief (ADC_INPUTCTRL)  */
#define ADC_INPUTCTRL_MASK                      0x0FFF1F1Fu    /**< \brief (ADC_INPUTCTRL) MASK Register */

/* -------- ADC_EVCTRL : (ADC Offset: 0x14) (R/W  8) Event Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t STARTEI : 1;  /*!< bit:      0  Start Conversion Event In          */
            uint8_t SYNCEI : 1;   /*!< bit:      1  Sync Event In                      */
            uint8_t  : 2;         /*!< bit:  2.. 3  Reserved                           */
            uint8_t RESRDYEO : 1; /*!< bit:      4  Result Ready Event Out             */
            uint8_t WINMONEO : 1; /*!< bit:      5  Window Monitor Event Out           */
            uint8_t  : 2;         /*!< bit:  6.. 7  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint8_t reg;              /*!< Type      used for register access              */
    } ADC_EVCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

