FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_adc.h
#define ADC_EVCTRL_OFFSET          0x14          /**< \brief (ADC_EVCTRL offset) Event Control Register */
#define ADC_EVCTRL_RESETVALUE      0x00          /**< \brief (ADC_EVCTRL reset_value) Event Control Register */

#define ADC_EVCTRL_STARTEI_Pos     0             /**< \brief (ADC_EVCTRL) Start Conversion Event In */
#define ADC_EVCTRL_STARTEI         ( 0x1u << ADC_EVCTRL_STARTEI_Pos )
#define ADC_EVCTRL_SYNCEI_Pos      1             /**< \brief (ADC_EVCTRL) Sync Event In */
#define ADC_EVCTRL_SYNCEI          ( 0x1u << ADC_EVCTRL_SYNCEI_Pos )
#define ADC_EVCTRL_RESRDYEO_Pos    4             /**< \brief (ADC_EVCTRL) Result Ready Event Out */
#define ADC_EVCTRL_RESRDYEO        ( 0x1u << ADC_EVCTRL_RESRDYEO_Pos )
#define ADC_EVCTRL_WINMONEO_Pos    5             /**< \brief (ADC_EVCTRL) Window Monitor Event Out */
#define ADC_EVCTRL_WINMONEO        ( 0x1u << ADC_EVCTRL_WINMONEO_Pos )
#define ADC_EVCTRL_MASK            0x33u         /**< \brief (ADC_EVCTRL) MASK Register */

/* -------- ADC_INTENCLR : (ADC Offset: 0x16) (R/W  8) Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t RESRDY : 1;  /*!< bit:      0  Result Ready Interrupt Disable     */
            uint8_t OVERRUN : 1; /*!< bit:      1  Overrun Interrupt Disable          */
            uint8_t WINMON : 1;  /*!< bit:      2  Window Monitor Interrupt Disable   */
            uint8_t SYNCRDY : 1; /*!< bit:      3  Synchronisation Ready Interrupt Disable */
            uint8_t  : 4;        /*!< bit:  4.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } ADC_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_INTENCLR_OFFSET         0x16         /**< \brief (ADC_INTENCLR offset) Interrupt Enable Clear Register */
#define ADC_INTENCLR_RESETVALUE     0x00         /**< \brief (ADC_INTENCLR reset_value) Interrupt Enable Clear Register */

#define ADC_INTENCLR_RESRDY_Pos     0            /**< \brief (ADC_INTENCLR) Result Ready Interrupt Disable */
#define ADC_INTENCLR_RESRDY         ( 0x1u << ADC_INTENCLR_RESRDY_Pos )
#define ADC_INTENCLR_OVERRUN_Pos    1            /**< \brief (ADC_INTENCLR) Overrun Interrupt Disable */
#define ADC_INTENCLR_OVERRUN        ( 0x1u << ADC_INTENCLR_OVERRUN_Pos )
#define ADC_INTENCLR_WINMON_Pos     2            /**< \brief (ADC_INTENCLR) Window Monitor Interrupt Disable */
#define ADC_INTENCLR_WINMON         ( 0x1u << ADC_INTENCLR_WINMON_Pos )
#define ADC_INTENCLR_SYNCRDY_Pos    3            /**< \brief (ADC_INTENCLR) Synchronisation Ready Interrupt Disable */
#define ADC_INTENCLR_SYNCRDY        ( 0x1u << ADC_INTENCLR_SYNCRDY_Pos )
#define ADC_INTENCLR_MASK           0x0Fu        /**< \brief (ADC_INTENCLR) MASK Register */

/* -------- ADC_INTENSET : (ADC Offset: 0x17) (R/W  8) Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t RESRDY : 1;  /*!< bit:      0  Result Ready Interrupt Enable      */
            uint8_t OVERRUN : 1; /*!< bit:      1  Overrun Interrupt Enable           */
            uint8_t WINMON : 1;  /*!< bit:      2  Window Monitor Interrupt Enable    */
            uint8_t SYNCRDY : 1; /*!< bit:      3  Synchronisation Ready Interrupt Enable */
            uint8_t  : 4;        /*!< bit:  4.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } ADC_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_INTENSET_OFFSET         0x17         /**< \brief (ADC_INTENSET offset) Interrupt Enable Set Register */
#define ADC_INTENSET_RESETVALUE     0x00         /**< \brief (ADC_INTENSET reset_value) Interrupt Enable Set Register */

#define ADC_INTENSET_RESRDY_Pos     0            /**< \brief (ADC_INTENSET) Result Ready Interrupt Enable */
#define ADC_INTENSET_RESRDY         ( 0x1u << ADC_INTENSET_RESRDY_Pos )
#define ADC_INTENSET_OVERRUN_Pos    1            /**< \brief (ADC_INTENSET) Overrun Interrupt Enable */
#define ADC_INTENSET_OVERRUN        ( 0x1u << ADC_INTENSET_OVERRUN_Pos )
#define ADC_INTENSET_WINMON_Pos     2            /**< \brief (ADC_INTENSET) Window Monitor Interrupt Enable */
#define ADC_INTENSET_WINMON         ( 0x1u << ADC_INTENSET_WINMON_Pos )
#define ADC_INTENSET_SYNCRDY_Pos    3            /**< \brief (ADC_INTENSET) Synchronisation Ready Interrupt Enable */
#define ADC_INTENSET_SYNCRDY        ( 0x1u << ADC_INTENSET_SYNCRDY_Pos )
#define ADC_INTENSET_MASK           0x0Fu        /**< \brief (ADC_INTENSET) MASK Register */

/* -------- ADC_INTFLAG : (ADC Offset: 0x18) (R/W  8) Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t RESRDY : 1;  /*!< bit:      0  Result Ready Interrupt Flag        */
            uint8_t OVERRUN : 1; /*!< bit:      1  Overrun Interrupt Flag             */
            uint8_t WINMON : 1;  /*!< bit:      2  Window Monitor Interrupt Flag      */
            uint8_t SYNCRDY : 1; /*!< bit:      3  Synchronisation Ready Interrupt Flag */
            uint8_t  : 4;        /*!< bit:  4.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } ADC_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_INTFLAG_OFFSET         0x18          /**< \brief (ADC_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define ADC_INTFLAG_RESETVALUE     0x00          /**< \brief (ADC_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define ADC_INTFLAG_RESRDY_Pos     0             /**< \brief (ADC_INTFLAG) Result Ready Interrupt Flag */
#define ADC_INTFLAG_RESRDY         ( 0x1u << ADC_INTFLAG_RESRDY_Pos )
#define ADC_INTFLAG_OVERRUN_Pos    1             /**< \brief (ADC_INTFLAG) Overrun Interrupt Flag */
#define ADC_INTFLAG_OVERRUN        ( 0x1u << ADC_INTFLAG_OVERRUN_Pos )
#define ADC_INTFLAG_WINMON_Pos     2             /**< \brief (ADC_INTFLAG) Window Monitor Interrupt Flag */
#define ADC_INTFLAG_WINMON         ( 0x1u << ADC_INTFLAG_WINMON_Pos )
#define ADC_INTFLAG_SYNCRDY_Pos    3             /**< \brief (ADC_INTFLAG) Synchronisation Ready Interrupt Flag */
#define ADC_INTFLAG_SYNCRDY        ( 0x1u << ADC_INTFLAG_SYNCRDY_Pos )
#define ADC_INTFLAG_MASK           0x0Fu         /**< \brief (ADC_INTFLAG) MASK Register */

