FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_adc.h
/* -------- ADC_STATUS : (ADC Offset: 0x19) (R/   8) Status Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t  : 7;         /*!< bit:  0.. 6  Reserved                           */
            uint8_t SYNCBUSY : 1; /*!< bit:      7  Synchronisation Busy Status        */
        } bit;                    /*!< Structure used for bit  access                  */
        uint8_t reg;              /*!< Type      used for register access              */
    } ADC_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_STATUS_OFFSET          0x19          /**< \brief (ADC_STATUS offset) Status Register */
#define ADC_STATUS_RESETVALUE      0x00          /**< \brief (ADC_STATUS reset_value) Status Register */

#define ADC_STATUS_SYNCBUSY_Pos    7             /**< \brief (ADC_STATUS) Synchronisation Busy Status */
#define ADC_STATUS_SYNCBUSY        ( 0x1u << ADC_STATUS_SYNCBUSY_Pos )
#define ADC_STATUS_MASK            0x80u         /**< \brief (ADC_STATUS) MASK Register */

/* -------- ADC_RESULT : (ADC Offset: 0x1A) (R/  16) Result Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t RESULT : 16; /*!< bit:  0..15  Result Value                       */
        } bit;                    /*!< Structure used for bit  access                  */
        uint16_t reg;             /*!< Type      used for register access              */
    } ADC_RESULT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_RESULT_OFFSET        0x1A            /**< \brief (ADC_RESULT offset) Result Register */
#define ADC_RESULT_RESETVALUE    0x0000          /**< \brief (ADC_RESULT reset_value) Result Register */

#define ADC_RESULT_RESULT_Pos    0               /**< \brief (ADC_RESULT) Result Value */
#define ADC_RESULT_RESULT_Msk    ( 0xFFFFu << ADC_RESULT_RESULT_Pos )
#define ADC_RESULT_RESULT( value )    ( ( ADC_RESULT_RESULT_Msk & ( ( value ) << ADC_RESULT_RESULT_Pos ) ) )
#define ADC_RESULT_MASK          0xFFFFu         /**< \brief (ADC_RESULT) MASK Register */

/* -------- ADC_WINLT : (ADC Offset: 0x1C) (R/W 16) Window Monitor Lower Threshold Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t WINLT : 16; /*!< bit:  0..15  Window Lower Threshold             */
        } bit;                   /*!< Structure used for bit  access                  */
        uint16_t reg;            /*!< Type      used for register access              */
    } ADC_WINLT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_WINLT_OFFSET        0x1C             /**< \brief (ADC_WINLT offset) Window Monitor Lower Threshold Register */
#define ADC_WINLT_RESETVALUE    0x0000           /**< \brief (ADC_WINLT reset_value) Window Monitor Lower Threshold Register */

#define ADC_WINLT_WINLT_Pos     0                /**< \brief (ADC_WINLT) Window Lower Threshold */
#define ADC_WINLT_WINLT_Msk     ( 0xFFFFu << ADC_WINLT_WINLT_Pos )
#define ADC_WINLT_WINLT( value )    ( ( ADC_WINLT_WINLT_Msk & ( ( value ) << ADC_WINLT_WINLT_Pos ) ) )
#define ADC_WINLT_MASK          0xFFFFu          /**< \brief (ADC_WINLT) MASK Register */

/* -------- ADC_WINUT : (ADC Offset: 0x20) (R/W 16) Window Monitor Upper Threshold Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t WINUT : 16; /*!< bit:  0..15  Window Upper Threshold             */
        } bit;                   /*!< Structure used for bit  access                  */
        uint16_t reg;            /*!< Type      used for register access              */
    } ADC_WINUT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_WINUT_OFFSET        0x20             /**< \brief (ADC_WINUT offset) Window Monitor Upper Threshold Register */
#define ADC_WINUT_RESETVALUE    0x0000           /**< \brief (ADC_WINUT reset_value) Window Monitor Upper Threshold Register */

#define ADC_WINUT_WINUT_Pos     0                /**< \brief (ADC_WINUT) Window Upper Threshold */
#define ADC_WINUT_WINUT_Msk     ( 0xFFFFu << ADC_WINUT_WINUT_Pos )
#define ADC_WINUT_WINUT( value )    ( ( ADC_WINUT_WINUT_Msk & ( ( value ) << ADC_WINUT_WINUT_Pos ) ) )
#define ADC_WINUT_MASK          0xFFFFu          /**< \brief (ADC_WINUT) MASK Register */

/* -------- ADC_GAINCORR : (ADC Offset: 0x24) (R/W 16) Gain Correction Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t GAINCORR : 12; /*!< bit:  0..11  Gain Correction Value              */
            uint16_t : 4;           /*!< bit: 12..15  Reserved                           */
        } bit;                      /*!< Structure used for bit  access                  */
        uint16_t reg;               /*!< Type      used for register access              */
    } ADC_GAINCORR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_GAINCORR_OFFSET          0x24        /**< \brief (ADC_GAINCORR offset) Gain Correction Register */
#define ADC_GAINCORR_RESETVALUE      0x0000      /**< \brief (ADC_GAINCORR reset_value) Gain Correction Register */

#define ADC_GAINCORR_GAINCORR_Pos    0           /**< \brief (ADC_GAINCORR) Gain Correction Value */
#define ADC_GAINCORR_GAINCORR_Msk    ( 0xFFFu << ADC_GAINCORR_GAINCORR_Pos )
#define ADC_GAINCORR_GAINCORR( value )    ( ( ADC_GAINCORR_GAINCORR_Msk & ( ( value ) << ADC_GAINCORR_GAINCORR_Pos ) ) )
#define ADC_GAINCORR_MASK            0x0FFFu     /**< \brief (ADC_GAINCORR) MASK Register */

/* -------- ADC_OFFSETCORR : (ADC Offset: 0x26) (R/W 16) Offset Correction Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t OFFSETCORR : 12; /*!< bit:  0..11  Offset Correction Value            */
            uint16_t : 4;             /*!< bit: 12..15  Reserved                           */
        } bit;                        /*!< Structure used for bit  access                  */
        uint16_t reg;                 /*!< Type      used for register access              */
    } ADC_OFFSETCORR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

