FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_adc.h
#define ADC_OFFSETCORR_OFFSET            0x26    /**< \brief (ADC_OFFSETCORR offset) Offset Correction Register */
#define ADC_OFFSETCORR_RESETVALUE        0x0000  /**< \brief (ADC_OFFSETCORR reset_value) Offset Correction Register */

#define ADC_OFFSETCORR_OFFSETCORR_Pos    0       /**< \brief (ADC_OFFSETCORR) Offset Correction Value */
#define ADC_OFFSETCORR_OFFSETCORR_Msk    ( 0xFFFu << ADC_OFFSETCORR_OFFSETCORR_Pos )
#define ADC_OFFSETCORR_OFFSETCORR( value )    ( ( ADC_OFFSETCORR_OFFSETCORR_Msk & ( ( value ) << ADC_OFFSETCORR_OFFSETCORR_Pos ) ) )
#define ADC_OFFSETCORR_MASK              0x0FFFu /**< \brief (ADC_OFFSETCORR) MASK Register */

/* -------- ADC_CALIB : (ADC Offset: 0x28) (R/W 16) Calibration Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t LINEARITY_CAL : 8; /*!< bit:  0.. 7  Linearity Calibration              */
            uint16_t BIAS_CAL : 3;      /*!< bit:  8..10  Bias  Configuration                */
            uint16_t : 5;               /*!< bit: 11..15  Reserved                           */
        } bit;                          /*!< Structure used for bit  access                  */
        uint16_t reg;                   /*!< Type      used for register access              */
    } ADC_CALIB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_CALIB_OFFSET               0x28      /**< \brief (ADC_CALIB offset) Calibration Register */
#define ADC_CALIB_RESETVALUE           0x0000    /**< \brief (ADC_CALIB reset_value) Calibration Register */

#define ADC_CALIB_LINEARITY_CAL_Pos    0         /**< \brief (ADC_CALIB) Linearity Calibration */
#define ADC_CALIB_LINEARITY_CAL_Msk    ( 0xFFu << ADC_CALIB_LINEARITY_CAL_Pos )
#define ADC_CALIB_LINEARITY_CAL( value )    ( ( ADC_CALIB_LINEARITY_CAL_Msk & ( ( value ) << ADC_CALIB_LINEARITY_CAL_Pos ) ) )
#define ADC_CALIB_BIAS_CAL_Pos         8         /**< \brief (ADC_CALIB) Bias  Configuration */
#define ADC_CALIB_BIAS_CAL_Msk         ( 0x7u << ADC_CALIB_BIAS_CAL_Pos )
#define ADC_CALIB_BIAS_CAL( value )         ( ( ADC_CALIB_BIAS_CAL_Msk & ( ( value ) << ADC_CALIB_BIAS_CAL_Pos ) ) )
#define ADC_CALIB_MASK                 0x07FFu   /**< \brief (ADC_CALIB) MASK Register */

/* -------- ADC_DBGCTRL : (ADC Offset: 0x2A) (R/W  8) Debug Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DBGRUN : 1; /*!< bit:      0  Debug Run                          */
            uint8_t  : 7;       /*!< bit:  1.. 7  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint8_t reg;            /*!< Type      used for register access              */
    } ADC_DBGCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_DBGCTRL_OFFSET        0x2A           /**< \brief (ADC_DBGCTRL offset) Debug Register */
#define ADC_DBGCTRL_RESETVALUE    0x00           /**< \brief (ADC_DBGCTRL reset_value) Debug Register */

#define ADC_DBGCTRL_DBGRUN_Pos    0              /**< \brief (ADC_DBGCTRL) Debug Run */
#define ADC_DBGCTRL_DBGRUN        ( 0x1u << ADC_DBGCTRL_DBGRUN_Pos )
#define ADC_DBGCTRL_MASK          0x01u          /**< \brief (ADC_DBGCTRL) MASK Register */

/* -------- ADC_TEST : (ADC Offset: 0x2B) (R/W  8) Test Modes Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t TEST_EN : 1;    /*!< bit:      0  Enable Test Mode                   */
            uint8_t REFPAD_EN : 1;  /*!< bit:      1  Connect Vrefp/n to aio33testp/n    */
            uint8_t REFINT_DIS : 1; /*!< bit:      2  Disable Internal Reference         */
            uint8_t  : 5;           /*!< bit:  3.. 7  Reserved                           */
        } bit;                      /*!< Structure used for bit  access                  */
        uint8_t reg;                /*!< Type      used for register access              */
    } ADC_TEST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_TEST_OFFSET            0x2B          /**< \brief (ADC_TEST offset) Test Modes Register */
#define ADC_TEST_RESETVALUE        0x00          /**< \brief (ADC_TEST reset_value) Test Modes Register */

#define ADC_TEST_TEST_EN_Pos       0             /**< \brief (ADC_TEST) Enable Test Mode */
#define ADC_TEST_TEST_EN           ( 0x1u << ADC_TEST_TEST_EN_Pos )
#define ADC_TEST_REFPAD_EN_Pos     1             /**< \brief (ADC_TEST) Connect Vrefp/n to aio33testp/n */
#define ADC_TEST_REFPAD_EN         ( 0x1u << ADC_TEST_REFPAD_EN_Pos )
#define ADC_TEST_REFINT_DIS_Pos    2             /**< \brief (ADC_TEST) Disable Internal Reference */
#define ADC_TEST_REFINT_DIS        ( 0x1u << ADC_TEST_REFINT_DIS_Pos )
#define ADC_TEST_MASK              0x07u         /**< \brief (ADC_TEST) MASK Register */

/* -------- ADC_TESTRESULT : (ADC Offset: 0x2C) (R/W 32) Test Result Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t TESTRESULT : 24; /*!< bit:  0..23  Result Directly from ADC Hard Block */
            uint32_t : 8;             /*!< bit: 24..31  Reserved                           */
        } bit;                        /*!< Structure used for bit  access                  */
        uint32_t reg;                 /*!< Type      used for register access              */
    } ADC_TESTRESULT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ADC_TESTRESULT_OFFSET            0x2C       /**< \brief (ADC_TESTRESULT offset) Test Result Register */
#define ADC_TESTRESULT_RESETVALUE        0x00000000 /**< \brief (ADC_TESTRESULT reset_value) Test Result Register */

#define ADC_TESTRESULT_TESTRESULT_Pos    0          /**< \brief (ADC_TESTRESULT) Result Directly from ADC Hard Block */
#define ADC_TESTRESULT_TESTRESULT_Msk    ( 0xFFFFFFu << ADC_TESTRESULT_TESTRESULT_Pos )
#define ADC_TESTRESULT_TESTRESULT( value )    ( ( ADC_TESTRESULT_TESTRESULT_Msk & ( ( value ) << ADC_TESTRESULT_TESTRESULT_Pos ) ) )
#define ADC_TESTRESULT_MASK              0x00FFFFFFu /**< \brief (ADC_TESTRESULT) MASK Register */

/* -------- ADC_DCFG : (ADC Offset: 0x30) (R/W  8) Device Configuration -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t CMPDELAY : 1; /*!< bit:      0  Comparator Delay Control           */
            uint8_t BOOSTEN : 1;  /*!< bit:      1  Enable the SR Booster in the Op Amp */
            uint8_t VCMPULSE : 1; /*!< bit:      2  Enable VCM Pulse                   */
            uint8_t BIAS_OPA : 1; /*!< bit:      3  Select PTAT Biasing for OPA        */
            uint8_t  : 4;         /*!< bit:  4.. 7  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint8_t reg;              /*!< Type      used for register access              */
    } ADC_DCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

