FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_adc.h
#define ADC_DCFG_OFFSET          0x30            /**< \brief (ADC_DCFG offset) Device Configuration */
#define ADC_DCFG_RESETVALUE      0x00            /**< \brief (ADC_DCFG reset_value) Device Configuration */

#define ADC_DCFG_CMPDELAY_Pos    0               /**< \brief (ADC_DCFG) Comparator Delay Control */
#define ADC_DCFG_CMPDELAY        ( 0x1u << ADC_DCFG_CMPDELAY_Pos )
#define ADC_DCFG_BOOSTEN_Pos     1               /**< \brief (ADC_DCFG) Enable the SR Booster in the Op Amp */
#define ADC_DCFG_BOOSTEN         ( 0x1u << ADC_DCFG_BOOSTEN_Pos )
#define ADC_DCFG_VCMPULSE_Pos    2               /**< \brief (ADC_DCFG) Enable VCM Pulse */
#define ADC_DCFG_VCMPULSE        ( 0x1u << ADC_DCFG_VCMPULSE_Pos )
#define ADC_DCFG_BIAS_OPA_Pos    3               /**< \brief (ADC_DCFG) Select PTAT Biasing for OPA */
#define ADC_DCFG_BIAS_OPA        ( 0x1u << ADC_DCFG_BIAS_OPA_Pos )
#define ADC_DCFG_MASK            0x0Fu           /**< \brief (ADC_DCFG) MASK Register */

/** \brief ADC hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct
    {
        __IO ADC_CTRLA_Type CTRLA;            /**< \brief Offset: 0x00 (R/W  8) Control Register A */
        __IO ADC_REFCTRL_Type REFCTRL;        /**< \brief Offset: 0x01 (R/W  8) Reference Control Register */
        __IO ADC_AVGCTRL_Type AVGCTRL;        /**< \brief Offset: 0x02 (R/W  8) Average Control Register */
        __IO ADC_SAMPCTRL_Type SAMPCTRL;      /**< \brief Offset: 0x03 (R/W  8) Sample Time Control Register */
        __IO ADC_CTRLB_Type CTRLB;            /**< \brief Offset: 0x04 (R/W 16) Control Register B */
        RoReg8 Reserved1[ 0x2 ];
        __IO ADC_WINCTRL_Type WINCTRL;        /**< \brief Offset: 0x08 (R/W  8) Window Monitor Control Register */
        RoReg8 Reserved2[ 0x3 ];
        __IO ADC_SWTRIG_Type SWTRIG;          /**< \brief Offset: 0x0C (R/W  8) Control Register B */
        RoReg8 Reserved3[ 0x3 ];
        __IO ADC_INPUTCTRL_Type INPUTCTRL;    /**< \brief Offset: 0x10 (R/W 32) Input Control Register */
        __IO ADC_EVCTRL_Type EVCTRL;          /**< \brief Offset: 0x14 (R/W  8) Event Control Register */
        RoReg8 Reserved4[ 0x1 ];
        __IO ADC_INTENCLR_Type INTENCLR;      /**< \brief Offset: 0x16 (R/W  8) Interrupt Enable Clear Register */
        __IO ADC_INTENSET_Type INTENSET;      /**< \brief Offset: 0x17 (R/W  8) Interrupt Enable Set Register */
        __IO ADC_INTFLAG_Type INTFLAG;        /**< \brief Offset: 0x18 (R/W  8) Interrupt Flag Status and Clear Register */
        __I ADC_STATUS_Type STATUS;           /**< \brief Offset: 0x19 (R/   8) Status Register */
        __I ADC_RESULT_Type RESULT;           /**< \brief Offset: 0x1A (R/  16) Result Register */
        __IO ADC_WINLT_Type WINLT;            /**< \brief Offset: 0x1C (R/W 16) Window Monitor Lower Threshold Register */
        RoReg8 Reserved5[ 0x2 ];
        __IO ADC_WINUT_Type WINUT;            /**< \brief Offset: 0x20 (R/W 16) Window Monitor Upper Threshold Register */
        RoReg8 Reserved6[ 0x2 ];
        __IO ADC_GAINCORR_Type GAINCORR;      /**< \brief Offset: 0x24 (R/W 16) Gain Correction Register */
        __IO ADC_OFFSETCORR_Type OFFSETCORR;  /**< \brief Offset: 0x26 (R/W 16) Offset Correction Register */
        __IO ADC_CALIB_Type CALIB;            /**< \brief Offset: 0x28 (R/W 16) Calibration Register */
        __IO ADC_DBGCTRL_Type DBGCTRL;        /**< \brief Offset: 0x2A (R/W  8) Debug Register */
        __IO ADC_TEST_Type TEST;              /**< \brief Offset: 0x2B (R/W  8) Test Modes Register */
        __IO ADC_TESTRESULT_Type TESTRESULT;  /**< \brief Offset: 0x2C (R/W 32) Test Result Register */
        __IO ADC_DCFG_Type DCFG;              /**< \brief Offset: 0x30 (R/W  8) Device Configuration */
    } Adc;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAMD20_ADC_COMPONENT_ */
